package htp.home.task01.main;

/*
 * Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
 */

public class Task07 {

	public static void main(String[] args) {
		
		int l = 8;
		int w = l / 2;
		
		int s = l * w;
		
		System.out.println("площадь прямоугольника " + s);

	}

}
